joristork/robots/jobot_in_c/microchip_extras/h/p18f86j90.h
extern volatile near unsigned char       TMR3L;
extern volatile near unsigned char       TMR3H;
extern volatile near unsigned char       CMCON;
extern volatile near union {
  struct {
    unsigned CM:3;
    unsigned CIS:1;
    unsigned C1INV:1;
    unsigned C2INV:1;
    unsigned C1OUT:1;
    unsigned C2OUT:1;
  };
  struct {
    unsigned CM0:1;
    unsigned CM1:1;
    unsigned CM2:1;
  };
} CMCONbits;
extern volatile near unsigned char       CVRCON;
extern volatile near union {
  struct {
    unsigned CVR:4;
    unsigned CVRSS:1;
    unsigned CVRR:1;
    unsigned CVROE:1;
    unsigned CVREN:1;
  };
  struct {
    unsigned CVR0:1;
    unsigned CVR1:1;
    unsigned CVR2:1;
    unsigned CVR3:1;
  };
} CVRCONbits;
extern volatile near unsigned char       LCDSE1;
extern volatile near union {
  struct {
    unsigned LCDSE1:8;
  };
  struct {
    unsigned SE8:1;
    unsigned SE9:1;
    unsigned SE10:1;
    unsigned SE11:1;
    unsigned SE12:1;
    unsigned SE13:1;
    unsigned SE14:1;
    unsigned SE15:1;
  };
  struct {
    unsigned SEGEN8:1;
    unsigned SEGEN9:1;
    unsigned SEGEN10:1;
    unsigned SEGEN11:1;
    unsigned SEGEN12:1;
    unsigned SEGEN13:1;
    unsigned SEGEN14:1;
    unsigned SEGEN15:1;
  };
  struct {
    unsigned SE08:1;
    unsigned SE09:1;
  };
} LCDSE1bits;
extern volatile near unsigned char       LCDSE2;
extern volatile near union {
  struct {
    unsigned LCDSE2:8;
  };
  struct {
    unsigned SE16:1;
    unsigned SE17:1;
    unsigned SE18:1;
    unsigned SE19:1;
    unsigned SE20:1;
    unsigned SE21:1;
    unsigned SE22:1;
    unsigned SE23:1;
  };
  struct {
    unsigned SEGEN16:1;
    unsigned SEGEN17:1;
    unsigned SEGEN18:1;
    unsigned SEGEN19:1;
    unsigned SEGEN20:1;
    unsigned SEGEN21:1;
    unsigned SEGEN22:1;
    unsigned SEGEN23:1;
  };
} LCDSE2bits;
extern volatile near unsigned char       LCDSE3;
extern volatile near union {
  struct {
    unsigned LCDSE3:8;
  };
  struct {
    unsigned SE24:1;
    unsigned SE25:1;
    unsigned SE26:1;
    unsigned SE27:1;
    unsigned SE28:1;
    unsigned SE29:1;
    unsigned SE30:1;
    unsigned SE31:1;
  };
  struct {
    unsigned SEGEN24:1;
    unsigned SEGEN25:1;
    unsigned SEGEN26:1;
    unsigned SEGEN27:1;
    unsigned SEGEN28:1;
    unsigned SEGEN29:1;
    unsigned SEGEN30:1;
    unsigned SEGEN31:1;
  };
} LCDSE3bits;
extern volatile near unsigned char       LCDSE4;
extern volatile near union {
  struct {
    unsigned LCDSE4:8;
  };
  struct {
    unsigned SE32:1;
    unsigned SE33:1;
    unsigned SE34:1;
    unsigned SE35:1;
    unsigned SE36:1;
    unsigned SE37:1;
    unsigned SE38:1;
    unsigned SE39:1;
  };
  struct {
    unsigned SEGEN32:1;
    unsigned SEGEN33:1;
    unsigned SEGEN34:1;
    unsigned SEGEN35:1;
    unsigned SEGEN36:1;
    unsigned SEGEN37:1;
    unsigned SEGEN38:1;
    unsigned SEGEN39:1;
  };
} LCDSE4bits;
extern volatile near unsigned char       LCDSE5;
extern volatile near union {
  struct {
    unsigned LCDSE5:8;
  };
  struct {
    unsigned SE40:1;
    unsigned SE41:1;
    unsigned SE42:1;
    unsigned SE43:1;
    unsigned SE44:1;
    unsigned SE45:1;
    unsigned SE46:1;
    unsigned SE47:1;
  };
  struct {
    unsigned SEGEN40:1;
    unsigned SEGEN41:1;
    unsigned SEGEN42:1;
    unsigned SEGEN43:1;
    unsigned SEGEN44:1;
    unsigned SEGEN45:1;
    unsigned SEGEN46:1;
    unsigned SEGEN47:1;
  };
} LCDSE5bits;
extern volatile near unsigned char       LCDDATA0;
extern volatile near union {
  struct {
    unsigned LCDDATA0:8;
  };
  struct {
    unsigned S0C0:1;
    unsigned S1C0:1;
    unsigned S2C0:1;
    unsigned S3C0:1;
    unsigned S4C0:1;
    unsigned S5C0:1;
    unsigned S6C0:1;
    unsigned S7C0:1;
  };
  struct {
    unsigned SEG0COM0:1;
    unsigned SEG1COM0:1;
    unsigned SEG2COM0:1;
    unsigned SEG3COM0:1;
    unsigned SEG4COM0:1;
    unsigned SEG5COM0:1;
    unsigned SEG6COM0:1;
    unsigned SEG7COM0:1;
  };
  struct {
    unsigned S00C0:1;
    unsigned S01C0:1;
    unsigned S02C0:1;
    unsigned S03C0:1;
    unsigned S04C0:1;
    unsigned S05C0:1;
    unsigned S06C0:1;
    unsigned S07C0:1;
  };
} LCDDATA0bits;
extern volatile near unsigned char       LCDDATA1;
extern volatile near union {
  struct {
    unsigned LCDDATA1:8;
  };
  struct {
    unsigned S8C0:1;
    unsigned S9C0:1;
    unsigned S10C0:1;
    unsigned S11C0:1;
    unsigned S12C0:1;
    unsigned S13C0:1;
    unsigned S14C0:1;
    unsigned S15C0:1;
  };
  struct {
    unsigned SEG8COM0:1;
    unsigned SEG9COM0:1;
    unsigned SEG10COM0:1;
    unsigned SEG11COM0:1;
    unsigned SEG12COM0:1;
    unsigned SEG13COM0:1;
    unsigned SEG14COM0:1;
    unsigned SEG15COM0:1;
  };
  struct {
    unsigned S08C0:1;
    unsigned S09C0:1;
  };
} LCDDATA1bits;
extern volatile near unsigned char       LCDDATA2;
extern volatile near union {
  struct {
    unsigned LCDDATA2:8;
  };
  struct {
    unsigned S16C0:1;
    unsigned S17C0:1;
    unsigned S18C0:1;
    unsigned S19C0:1;
    unsigned S20C0:1;
    unsigned S21C0:1;
    unsigned S22C0:1;
    unsigned S23C0:1;
  };
  struct {
    unsigned SEG16COM0:1;
    unsigned SEG17COM0:1;
    unsigned SEG18COM0:1;
    unsigned SEG19COM0:1;
    unsigned SEG20COM0:1;
    unsigned SEG21COM0:1;
    unsigned SEG22COM0:1;
    unsigned SEG23COM0:1;
  };
} LCDDATA2bits;
extern volatile near unsigned char       LCDDATA3;
extern volatile near union {
  struct {
    unsigned LCDDATA3:8;
  };
  struct {
    unsigned S24C0:1;
    unsigned S25C0:1;
    unsigned S26C0:1;
    unsigned S27C0:1;
    unsigned S28C0:1;
    unsigned S29C0:1;
    unsigned S30C0:1;
    unsigned S31C0:1;
  };
  struct {
    unsigned SEG24COM0:1;
    unsigned SEG25COM0:1;
    unsigned SEG26COM0:1;
    unsigned SEG27COM0:1;
    unsigned SEG28COM0:1;
    unsigned SEG29COM0:1;
    unsigned SEG30COM0:1;
    unsigned SEG31COM0:1;
  };
} LCDDATA3bits;
extern volatile near unsigned char       LCDDATA4;
extern volatile near union {
  struct {
    unsigned LCDDATA4:8;
  };
  struct {
    unsigned S32C0:1;
    unsigned S33C0:1;
    unsigned S34C0:1;
    unsigned S35C0:1;
    unsigned S36C0:1;
    unsigned S37C0:1;
    unsigned S38C0:1;
    unsigned S39C0:1;
  };
  struct {
    unsigned SEG32COM0:1;
    unsigned SEG33COM0:1;
    unsigned SEG34COM0:1;
    unsigned SEG35COM0:1;
    unsigned SEG36COM0:1;
    unsigned SEG37COM0:1;
    unsigned SEG38COM0:1;
    unsigned SEG39COM0:1;
  };
} LCDDATA4bits;
